test/solver/incompressibleFluidNeoN/cases/turbulentBox/0/U
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
512
(
(4.3725802544692521e-02 7.1845114495151102e-02 -2.0299269353908314e-01)
(4.3725802544692521e-02 2.5651512996898113e-01 -4.3605515742529855e-01)
(4.3725802544692521e-02 4.4118514544281123e-01 -6.6911762131151387e-01)
(4.3725802544692521e-02 6.2585516091664117e-01 -9.0218008519772930e-01)
(4.3725802544692521e-02 8.1052517639047128e-01 -1.1352425490839448e+00)
(4.3725802544692521e-02 9.9519519186430139e-01 -1.3683050129701599e+00)
(4.3725802544692521e-02 1.1798652073381315e+00 -1.6013674768563755e+00)
(4.3725802544692521e-02 1.3645352228119616e+00 -1.8344299407425906e+00)
...
)
;

boundaryField
{
    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}
