test/solver/incompressibleFluidNeoN/cases/turbulentBox/0/k
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
512
(
5.7634599826669719e-01
5.6494276408922528e-01
2.7217610191460789e-01
3.9755647937215988e-01
3.1805777124755158e-01
3.5327671198242594e-01
2.0590763759546712e-01
5.8270185546074749e-01
...
)
;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
