test/solver/incompressibleFluidNeoN/cases/turbulentBox/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar>
512
(
4.3896252676538548e-04
1.0676499383837730e-03
1.1258124092891400e-03
7.7911380714456636e-04
8.0939270384077801e-04
1.7247753430931149e-03
1.2390497777596155e-03
6.8855332612607044e-04
...
)
;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
